blogs/socket_fd_leak.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-07 Tue 16:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>记一次排查socket fd泄漏</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zzyongx" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">记一次排查socket fd泄漏</h1>

<div id="outline-container-org9e279ac" class="outline-2">
<h2 id="org9e279ac"><span class="section-number-2">1</span> 故障表现</h2>
<div class="outline-text-2" id="text-1">
<p>
先说下系统架构，非常简单。本机nginx做接入，beego做后端，MySQL做存储，除了MySQL，外端还有少量的http接口对外调用。故障表现是，系统在测试环境运行一段时间后，beego接受新请求报错， <code>http: Accept error: accept tcp [::]:8080: accept4: too many open files; retrying in 1s</code> 。查看文件描述符限制 <code>ulimit -n</code> 得65535，查看 <code>ls -l /proc/&lt;pid&gt;/fd | wc -l</code> 得到65536且都是socket标记的，说明文件描述符的确耗尽了。查看 <code>netstat -anp | wc -l</code> ，并没有这么多连接。只能有一种解释，beego没有响应socket被动关闭，关闭文件描述符（fd）。
</p>
</div>
</div>

<div id="outline-container-org96443ab" class="outline-2">
<h2 id="org96443ab"><span class="section-number-2">2</span> 排查过程</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org079fd8b" class="outline-3">
<h3 id="org079fd8b"><span class="section-number-3">2.1</span> 查找哪些连接beego没有关闭</h3>
<div class="outline-text-3" id="text-2-1">
<p>
因为tcp被动关闭连接是不需要应用干涉的，虽然应用没有关闭fd，但是连接确实关闭了。因为故障时netstat已经看不到连接情况，所以需要记录故障前的连接快照。如果知道是连接哪个地址出的问题，就能找到相关代码，所以这步很关键。为此 1. 配置了cron，每分钟调用netstat，记录连接情况。 2. 配置监控，打开的网络描述符大于1000时报警。
</p>

<p>
从趋势图看，描述符的个数很稳定，并没有出现逐渐增大的情况。只能等报警时再排查。由于是测试环境，所以处理报警不及时，每次报警后查看现场，描述符都耗尽了。排查连接情况。
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ffff00;"># </span><span style="color: #ffff00;">&#33719;&#21462;fd&#23545;&#24212;&#36830;&#25509;&#30340;inode</span>
ls -l /proc/&lt;pid&gt;/fd | grep -Po <span style="color: #00ff00;">'socket:\[\d+'</span> | cut -d<span style="color: #00ff00;">'['</span> -f2 &gt; /tmp/inodes.txt
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">&#33719;&#21462;cron&#35760;&#24405;&#30340;&#36830;&#25509;&#65292;&#24182;&#26681;&#25454;inode&#23383;&#27573;&#25490;&#24207;&#65292;&#25490;&#37325;&#65292;&#36825;&#37324;tcpstat.*&#26159;&#20351;&#29992;&#25105;&#20204;&#30340;&#20869;&#37096;&#24037;&#20855;&#35760;&#24405;&#30340;&#36830;&#25509;&#24773;&#20917;&#65292;&#21487;&#20197;&#29992;netstat&#20195;&#26367;</span>
grep &lt;pid&gt; tcpstat.* | sort -k3,3 -u &gt; /tmp/tcp.txt
<span style="color: #ffff00;"># </span><span style="color: #ffff00;">&#26597;&#30475;inode&#23545;&#24212;&#30340;&#36830;&#25509;</span>
<span style="color: #00ffff; font-weight: bold;">for</span> inode<span style="color: #00ffff; font-weight: bold;"> in</span> $(<span style="color: #fa8072;">cat</span> /tmp/inodes.txt); <span style="color: #00ffff; font-weight: bold;">do</span> grep $<span style="color: #ffff00;">inode</span> /tmp/tcp.txt; <span style="color: #00ffff; font-weight: bold;">done</span>
</pre>
</div>

<p>
结果大大出乎意料，全是nginx连beego的请求，beego没有断开连接。查看beego的相关代码，我确定beego也没问题。查看beego的goroutine，发现都停在了sql获取连接上，（beego的sql自带连接池），由此判断因为没有文件描述符可用，所以无法获取连接。
</p>
</div>
</div>

<div id="outline-container-org52d9edb" class="outline-3">
<h3 id="org52d9edb"><span class="section-number-3">2.2</span> 现场很重要</h3>
<div class="outline-text-3" id="text-2-2">
<p>
beego没问题，泄漏的连接又没有提供有用线索，根据目前的掌握的信息无法判断问题的原因。前面说了，由于是测试环境（同样的代码线上环境没事儿），所以处理报警不及时，每次查看现场时文件描述符都已经耗尽了。结合趋势图，描述符个数一直很稳定，直到某个时点，开始不断往上增，直到耗尽。基于某个时点之后，fd就开始快速增加，我判断是某个内部状态出了问题所致，所以看到耗尽前的现场至关重要。
</p>

<p>
机会很快来了，在描述符升到1000的时候，我切断了所有测试请求，手动模拟用户请求，结果发现请求超时，beego阻塞在了sql获取连接上，进一步查看所有goroutine（pperf提供了查看函数，beego基于此提供了http接口，使用起来非常方便），发现都停在了sql获取连接上。
</p>

<p>
事情清楚了，不是因为没有描述符可用导致sql无法获取连接，而是因为sql无法获取连接，导致所有的请求都卡住了，nginx主动关闭了连接，导致beego积攒了大量未关闭描述符的连接。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zzyongx</p>
<p class="date">Created: 2020-07-07 Tue 16:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
